# Concatenate and Merge Functions

In [9]:
import pandas as pd
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"A":[1,2,3,5],"C":[21,22,23,24]})
pd.merge(var1,var2,how = "outer",indicator=True)
# using how parameter we can show the inner , outer , left and right part after merging this concept is similar to joins of sql
# using indicator parameter we can see how the data is merge

   A     B     C      _merge
0  1  11.0  21.0        both
1  2  12.0  22.0        both
2  3  13.0  23.0        both
3  4  14.0   NaN   left_only
4  5   NaN  24.0  right_only

In [12]:
# if we want to merge the below dataframes then we have to pass the left_index and right_index parameter as true
var3 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4 = pd.DataFrame({"A":[1,2,3,5],"B":[21,22,23,24]})
pd.merge(var3,var4,left_index=True,right_index=True,suffixes=["name","id"])
# using suffixes parameter we can give the name to the columns

   Aname  Bname  Aid  Bid
0      1     11    1   21
1      2     12    2   22
2      3     13    3   23
3      4     14    5   24

In [16]:
sr1 = pd.Series([1,2,3,4])
sr2 = pd.Series([11,12,13,14])
pd.concat([sr1,sr2])
# if we want to merge the series we can only do it using concat function
# if we want to merge the dataframe then we can use both merge and concat function 
# but in concat function it will not merge basis on the same column rather it will make new columns

0     1
1     2
2     3
3     4
0    11
1    12
2    13
3    14
dtype: int64

In [22]:
var3 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4 = pd.DataFrame({"A":[1,2],"C":[21,22]})
pd.concat([var3,var4],axis=1,join="outer",keys=["var3","var4"])
# join parameter is used to join according to the value if 
# inner -> intersection
# outer -> union
# keys parameter is used to give names to the columns.

  var3     var4
     A   B    A     C
0    1  11  1.0  21.0
1    2  12  2.0  22.0
2    3  13  NaN   NaN
3    4  14  NaN   NaN

# GroupBy Functions

In [25]:
var1 = pd.DataFrame({
    "Name":["a","b","c","a","a","b","c","c"],
    "S_1":[2,1,2,4,2,4,1,4],
    "S_2":[2,1,7,8,2,1,11,4]
})
var1

  Name  S_1  S_2
0    a    2    2
1    b    1    1
2    c    2    7
3    a    4    8
4    a    2    2
5    b    4    1
6    c    1   11
7    c    4    4

In [26]:
var_new = var1.groupby("Name") # in this way we can group the random data
var_new

In [27]:
for x,y in var_new: # in this way we can see the output
    print(x)
    print(y)
    print()

a
  Name  S_1  S_2
0    a    2    2
3    a    4    8
4    a    2    2

b
  Name  S_1  S_2
1    b    1    1
5    b    4    1

c
  Name  S_1  S_2
2    c    2    7
6    c    1   11
7    c    4    4

In [28]:
var_new.get_group("c") # in this way we can get the data of a specific cell in this eg c

  Name  S_1  S_2
2    c    2    7
6    c    1   11
7    c    4    4

In [30]:
# in the below way we can find out the min max and mean value of specific data
a = var_new.min()
print(a)
print()
b = var_new.max()
print(b)
print()
c= var_new.mean()
print(c)

      S_1  S_2
Name
a       2    2
b       1    1
c       1    4

      S_1  S_2
Name
a       4    8
b       4    1
c       4   11

           S_1       S_2
Name
a     2.666667  4.000000
b     2.500000  1.000000
c     2.333333  7.333333

In [31]:
li = list(var_new) # we can also save this in a list
print(li)

[('a',   Name  S_1  S_2
0    a    2    2
3    a    4    8
4    a    2    2), ('b',   Name  S_1  S_2
1    b    1    1
5    b    4    1), ('c',   Name  S_1  S_2
2    c    2    7
6    c    1   11
7    c    4    4)]